Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo_freertos/firmware/src/packs/PIC32CX2051MTC128_DFP/component/pwm.h
/* -------- PWM_SCUPUPD : (PWM Offset: 0x30) ( /W 32) PWM Sync Channels Update Period Update Register -------- */
#define PWM_SCUPUPD_UPRUPD_Pos                _UINT32_(0)                                          /* (PWM_SCUPUPD) Update Period Update Position */
#define PWM_SCUPUPD_UPRUPD_Msk                (_UINT32_(0xF) << PWM_SCUPUPD_UPRUPD_Pos)            /* (PWM_SCUPUPD) Update Period Update Mask */
#define PWM_SCUPUPD_UPRUPD(value)             (PWM_SCUPUPD_UPRUPD_Msk & (_UINT32_(value) << PWM_SCUPUPD_UPRUPD_Pos)) /* Assigment of value for UPRUPD in the PWM_SCUPUPD register */
#define PWM_SCUPUPD_Msk                       _UINT32_(0x0000000F)                                 /* (PWM_SCUPUPD) Register Mask  */


/* -------- PWM_IER2 : (PWM Offset: 0x34) ( /W 32) PWM Interrupt Enable Register 2 -------- */
#define PWM_IER2_WRDY_Pos                     _UINT32_(0)                                          /* (PWM_IER2) Write Ready for Synchronous Channels Update Interrupt Enable Position */
#define PWM_IER2_WRDY_Msk                     (_UINT32_(0x1) << PWM_IER2_WRDY_Pos)                 /* (PWM_IER2) Write Ready for Synchronous Channels Update Interrupt Enable Mask */
#define PWM_IER2_WRDY(value)                  (PWM_IER2_WRDY_Msk & (_UINT32_(value) << PWM_IER2_WRDY_Pos)) /* Assigment of value for WRDY in the PWM_IER2 register */
#define PWM_IER2_ENDTX_Pos                    _UINT32_(1)                                          /* (PWM_IER2) PDC End of TX Buffer Interrupt Enable Position */
#define PWM_IER2_ENDTX_Msk                    (_UINT32_(0x1) << PWM_IER2_ENDTX_Pos)                /* (PWM_IER2) PDC End of TX Buffer Interrupt Enable Mask */
#define PWM_IER2_ENDTX(value)                 (PWM_IER2_ENDTX_Msk & (_UINT32_(value) << PWM_IER2_ENDTX_Pos)) /* Assigment of value for ENDTX in the PWM_IER2 register */
#define PWM_IER2_TXBUFE_Pos                   _UINT32_(2)                                          /* (PWM_IER2) PDC TX Buffer Empty Interrupt Enable Position */
#define PWM_IER2_TXBUFE_Msk                   (_UINT32_(0x1) << PWM_IER2_TXBUFE_Pos)               /* (PWM_IER2) PDC TX Buffer Empty Interrupt Enable Mask */
#define PWM_IER2_TXBUFE(value)                (PWM_IER2_TXBUFE_Msk & (_UINT32_(value) << PWM_IER2_TXBUFE_Pos)) /* Assigment of value for TXBUFE in the PWM_IER2 register */
#define PWM_IER2_UNRE_Pos                     _UINT32_(3)                                          /* (PWM_IER2) Synchronous Channels Update Underrun Error Interrupt Enable Position */
#define PWM_IER2_UNRE_Msk                     (_UINT32_(0x1) << PWM_IER2_UNRE_Pos)                 /* (PWM_IER2) Synchronous Channels Update Underrun Error Interrupt Enable Mask */
#define PWM_IER2_UNRE(value)                  (PWM_IER2_UNRE_Msk & (_UINT32_(value) << PWM_IER2_UNRE_Pos)) /* Assigment of value for UNRE in the PWM_IER2 register */
#define PWM_IER2_CMPM0_Pos                    _UINT32_(8)                                          /* (PWM_IER2) Comparison 0 Match Interrupt Enable Position */
#define PWM_IER2_CMPM0_Msk                    (_UINT32_(0x1) << PWM_IER2_CMPM0_Pos)                /* (PWM_IER2) Comparison 0 Match Interrupt Enable Mask */
#define PWM_IER2_CMPM0(value)                 (PWM_IER2_CMPM0_Msk & (_UINT32_(value) << PWM_IER2_CMPM0_Pos)) /* Assigment of value for CMPM0 in the PWM_IER2 register */
#define PWM_IER2_CMPM1_Pos                    _UINT32_(9)                                          /* (PWM_IER2) Comparison 1 Match Interrupt Enable Position */
#define PWM_IER2_CMPM1_Msk                    (_UINT32_(0x1) << PWM_IER2_CMPM1_Pos)                /* (PWM_IER2) Comparison 1 Match Interrupt Enable Mask */
#define PWM_IER2_CMPM1(value)                 (PWM_IER2_CMPM1_Msk & (_UINT32_(value) << PWM_IER2_CMPM1_Pos)) /* Assigment of value for CMPM1 in the PWM_IER2 register */
#define PWM_IER2_CMPM2_Pos                    _UINT32_(10)                                         /* (PWM_IER2) Comparison 2 Match Interrupt Enable Position */
#define PWM_IER2_CMPM2_Msk                    (_UINT32_(0x1) << PWM_IER2_CMPM2_Pos)                /* (PWM_IER2) Comparison 2 Match Interrupt Enable Mask */
#define PWM_IER2_CMPM2(value)                 (PWM_IER2_CMPM2_Msk & (_UINT32_(value) << PWM_IER2_CMPM2_Pos)) /* Assigment of value for CMPM2 in the PWM_IER2 register */
#define PWM_IER2_CMPM3_Pos                    _UINT32_(11)                                         /* (PWM_IER2) Comparison 3 Match Interrupt Enable Position */
#define PWM_IER2_CMPM3_Msk                    (_UINT32_(0x1) << PWM_IER2_CMPM3_Pos)                /* (PWM_IER2) Comparison 3 Match Interrupt Enable Mask */
#define PWM_IER2_CMPM3(value)                 (PWM_IER2_CMPM3_Msk & (_UINT32_(value) << PWM_IER2_CMPM3_Pos)) /* Assigment of value for CMPM3 in the PWM_IER2 register */
#define PWM_IER2_CMPM4_Pos                    _UINT32_(12)                                         /* (PWM_IER2) Comparison 4 Match Interrupt Enable Position */
#define PWM_IER2_CMPM4_Msk                    (_UINT32_(0x1) << PWM_IER2_CMPM4_Pos)                /* (PWM_IER2) Comparison 4 Match Interrupt Enable Mask */
#define PWM_IER2_CMPM4(value)                 (PWM_IER2_CMPM4_Msk & (_UINT32_(value) << PWM_IER2_CMPM4_Pos)) /* Assigment of value for CMPM4 in the PWM_IER2 register */
#define PWM_IER2_CMPM5_Pos                    _UINT32_(13)                                         /* (PWM_IER2) Comparison 5 Match Interrupt Enable Position */
#define PWM_IER2_CMPM5_Msk                    (_UINT32_(0x1) << PWM_IER2_CMPM5_Pos)                /* (PWM_IER2) Comparison 5 Match Interrupt Enable Mask */
#define PWM_IER2_CMPM5(value)                 (PWM_IER2_CMPM5_Msk & (_UINT32_(value) << PWM_IER2_CMPM5_Pos)) /* Assigment of value for CMPM5 in the PWM_IER2 register */
#define PWM_IER2_CMPM6_Pos                    _UINT32_(14)                                         /* (PWM_IER2) Comparison 6 Match Interrupt Enable Position */
#define PWM_IER2_CMPM6_Msk                    (_UINT32_(0x1) << PWM_IER2_CMPM6_Pos)                /* (PWM_IER2) Comparison 6 Match Interrupt Enable Mask */
#define PWM_IER2_CMPM6(value)                 (PWM_IER2_CMPM6_Msk & (_UINT32_(value) << PWM_IER2_CMPM6_Pos)) /* Assigment of value for CMPM6 in the PWM_IER2 register */
#define PWM_IER2_CMPM7_Pos                    _UINT32_(15)                                         /* (PWM_IER2) Comparison 7 Match Interrupt Enable Position */
#define PWM_IER2_CMPM7_Msk                    (_UINT32_(0x1) << PWM_IER2_CMPM7_Pos)                /* (PWM_IER2) Comparison 7 Match Interrupt Enable Mask */
#define PWM_IER2_CMPM7(value)                 (PWM_IER2_CMPM7_Msk & (_UINT32_(value) << PWM_IER2_CMPM7_Pos)) /* Assigment of value for CMPM7 in the PWM_IER2 register */
#define PWM_IER2_CMPU0_Pos                    _UINT32_(16)                                         /* (PWM_IER2) Comparison 0 Update Interrupt Enable Position */
#define PWM_IER2_CMPU0_Msk                    (_UINT32_(0x1) << PWM_IER2_CMPU0_Pos)                /* (PWM_IER2) Comparison 0 Update Interrupt Enable Mask */
#define PWM_IER2_CMPU0(value)                 (PWM_IER2_CMPU0_Msk & (_UINT32_(value) << PWM_IER2_CMPU0_Pos)) /* Assigment of value for CMPU0 in the PWM_IER2 register */
#define PWM_IER2_CMPU1_Pos                    _UINT32_(17)                                         /* (PWM_IER2) Comparison 1 Update Interrupt Enable Position */
#define PWM_IER2_CMPU1_Msk                    (_UINT32_(0x1) << PWM_IER2_CMPU1_Pos)                /* (PWM_IER2) Comparison 1 Update Interrupt Enable Mask */
#define PWM_IER2_CMPU1(value)                 (PWM_IER2_CMPU1_Msk & (_UINT32_(value) << PWM_IER2_CMPU1_Pos)) /* Assigment of value for CMPU1 in the PWM_IER2 register */
#define PWM_IER2_CMPU2_Pos                    _UINT32_(18)                                         /* (PWM_IER2) Comparison 2 Update Interrupt Enable Position */
#define PWM_IER2_CMPU2_Msk                    (_UINT32_(0x1) << PWM_IER2_CMPU2_Pos)                /* (PWM_IER2) Comparison 2 Update Interrupt Enable Mask */
#define PWM_IER2_CMPU2(value)                 (PWM_IER2_CMPU2_Msk & (_UINT32_(value) << PWM_IER2_CMPU2_Pos)) /* Assigment of value for CMPU2 in the PWM_IER2 register */
#define PWM_IER2_CMPU3_Pos                    _UINT32_(19)                                         /* (PWM_IER2) Comparison 3 Update Interrupt Enable Position */
#define PWM_IER2_CMPU3_Msk                    (_UINT32_(0x1) << PWM_IER2_CMPU3_Pos)                /* (PWM_IER2) Comparison 3 Update Interrupt Enable Mask */
#define PWM_IER2_CMPU3(value)                 (PWM_IER2_CMPU3_Msk & (_UINT32_(value) << PWM_IER2_CMPU3_Pos)) /* Assigment of value for CMPU3 in the PWM_IER2 register */
#define PWM_IER2_CMPU4_Pos                    _UINT32_(20)                                         /* (PWM_IER2) Comparison 4 Update Interrupt Enable Position */
#define PWM_IER2_CMPU4_Msk                    (_UINT32_(0x1) << PWM_IER2_CMPU4_Pos)                /* (PWM_IER2) Comparison 4 Update Interrupt Enable Mask */
#define PWM_IER2_CMPU4(value)                 (PWM_IER2_CMPU4_Msk & (_UINT32_(value) << PWM_IER2_CMPU4_Pos)) /* Assigment of value for CMPU4 in the PWM_IER2 register */
#define PWM_IER2_CMPU5_Pos                    _UINT32_(21)                                         /* (PWM_IER2) Comparison 5 Update Interrupt Enable Position */
#define PWM_IER2_CMPU5_Msk                    (_UINT32_(0x1) << PWM_IER2_CMPU5_Pos)                /* (PWM_IER2) Comparison 5 Update Interrupt Enable Mask */
#define PWM_IER2_CMPU5(value)                 (PWM_IER2_CMPU5_Msk & (_UINT32_(value) << PWM_IER2_CMPU5_Pos)) /* Assigment of value for CMPU5 in the PWM_IER2 register */
#define PWM_IER2_CMPU6_Pos                    _UINT32_(22)                                         /* (PWM_IER2) Comparison 6 Update Interrupt Enable Position */
#define PWM_IER2_CMPU6_Msk                    (_UINT32_(0x1) << PWM_IER2_CMPU6_Pos)                /* (PWM_IER2) Comparison 6 Update Interrupt Enable Mask */
#define PWM_IER2_CMPU6(value)                 (PWM_IER2_CMPU6_Msk & (_UINT32_(value) << PWM_IER2_CMPU6_Pos)) /* Assigment of value for CMPU6 in the PWM_IER2 register */
#define PWM_IER2_CMPU7_Pos                    _UINT32_(23)                                         /* (PWM_IER2) Comparison 7 Update Interrupt Enable Position */
#define PWM_IER2_CMPU7_Msk                    (_UINT32_(0x1) << PWM_IER2_CMPU7_Pos)                /* (PWM_IER2) Comparison 7 Update Interrupt Enable Mask */
#define PWM_IER2_CMPU7(value)                 (PWM_IER2_CMPU7_Msk & (_UINT32_(value) << PWM_IER2_CMPU7_Pos)) /* Assigment of value for CMPU7 in the PWM_IER2 register */
#define PWM_IER2_Msk                          _UINT32_(0x00FFFF0F)                                 /* (PWM_IER2) Register Mask  */

#define PWM_IER2_CMPM_Pos                     _UINT32_(8)                                          /* (PWM_IER2 Position) Comparison x Match Interrupt Enable */
#define PWM_IER2_CMPM_Msk                     (_UINT32_(0xFF) << PWM_IER2_CMPM_Pos)                /* (PWM_IER2 Mask) CMPM */
#define PWM_IER2_CMPM(value)                  (PWM_IER2_CMPM_Msk & (_UINT32_(value) << PWM_IER2_CMPM_Pos)) 
#define PWM_IER2_CMPU_Pos                     _UINT32_(16)                                         /* (PWM_IER2 Position) Comparison 7 Update Interrupt Enable */
#define PWM_IER2_CMPU_Msk                     (_UINT32_(0xFF) << PWM_IER2_CMPU_Pos)                /* (PWM_IER2 Mask) CMPU */
#define PWM_IER2_CMPU(value)                  (PWM_IER2_CMPU_Msk & (_UINT32_(value) << PWM_IER2_CMPU_Pos)) 

/* -------- PWM_IDR2 : (PWM Offset: 0x38) ( /W 32) PWM Interrupt Disable Register 2 -------- */
#define PWM_IDR2_WRDY_Pos                     _UINT32_(0)                                          /* (PWM_IDR2) Write Ready for Synchronous Channels Update Interrupt Disable Position */
#define PWM_IDR2_WRDY_Msk                     (_UINT32_(0x1) << PWM_IDR2_WRDY_Pos)                 /* (PWM_IDR2) Write Ready for Synchronous Channels Update Interrupt Disable Mask */
#define PWM_IDR2_WRDY(value)                  (PWM_IDR2_WRDY_Msk & (_UINT32_(value) << PWM_IDR2_WRDY_Pos)) /* Assigment of value for WRDY in the PWM_IDR2 register */
#define PWM_IDR2_ENDTX_Pos                    _UINT32_(1)                                          /* (PWM_IDR2) PDC End of TX Buffer Interrupt Disable Position */
#define PWM_IDR2_ENDTX_Msk                    (_UINT32_(0x1) << PWM_IDR2_ENDTX_Pos)                /* (PWM_IDR2) PDC End of TX Buffer Interrupt Disable Mask */
#define PWM_IDR2_ENDTX(value)                 (PWM_IDR2_ENDTX_Msk & (_UINT32_(value) << PWM_IDR2_ENDTX_Pos)) /* Assigment of value for ENDTX in the PWM_IDR2 register */
#define PWM_IDR2_TXBUFE_Pos                   _UINT32_(2)                                          /* (PWM_IDR2) PDC TX Buffer Empty Interrupt Disable Position */
#define PWM_IDR2_TXBUFE_Msk                   (_UINT32_(0x1) << PWM_IDR2_TXBUFE_Pos)               /* (PWM_IDR2) PDC TX Buffer Empty Interrupt Disable Mask */
#define PWM_IDR2_TXBUFE(value)                (PWM_IDR2_TXBUFE_Msk & (_UINT32_(value) << PWM_IDR2_TXBUFE_Pos)) /* Assigment of value for TXBUFE in the PWM_IDR2 register */
#define PWM_IDR2_UNRE_Pos                     _UINT32_(3)                                          /* (PWM_IDR2) Synchronous Channels Update Underrun Error Interrupt Disable Position */
#define PWM_IDR2_UNRE_Msk                     (_UINT32_(0x1) << PWM_IDR2_UNRE_Pos)                 /* (PWM_IDR2) Synchronous Channels Update Underrun Error Interrupt Disable Mask */
#define PWM_IDR2_UNRE(value)                  (PWM_IDR2_UNRE_Msk & (_UINT32_(value) << PWM_IDR2_UNRE_Pos)) /* Assigment of value for UNRE in the PWM_IDR2 register */
#define PWM_IDR2_CMPM0_Pos                    _UINT32_(8)                                          /* (PWM_IDR2) Comparison 0 Match Interrupt Disable Position */
#define PWM_IDR2_CMPM0_Msk                    (_UINT32_(0x1) << PWM_IDR2_CMPM0_Pos)                /* (PWM_IDR2) Comparison 0 Match Interrupt Disable Mask */
#define PWM_IDR2_CMPM0(value)                 (PWM_IDR2_CMPM0_Msk & (_UINT32_(value) << PWM_IDR2_CMPM0_Pos)) /* Assigment of value for CMPM0 in the PWM_IDR2 register */
#define PWM_IDR2_CMPM1_Pos                    _UINT32_(9)                                          /* (PWM_IDR2) Comparison 1 Match Interrupt Disable Position */
#define PWM_IDR2_CMPM1_Msk                    (_UINT32_(0x1) << PWM_IDR2_CMPM1_Pos)                /* (PWM_IDR2) Comparison 1 Match Interrupt Disable Mask */
#define PWM_IDR2_CMPM1(value)                 (PWM_IDR2_CMPM1_Msk & (_UINT32_(value) << PWM_IDR2_CMPM1_Pos)) /* Assigment of value for CMPM1 in the PWM_IDR2 register */
#define PWM_IDR2_CMPM2_Pos                    _UINT32_(10)                                         /* (PWM_IDR2) Comparison 2 Match Interrupt Disable Position */
#define PWM_IDR2_CMPM2_Msk                    (_UINT32_(0x1) << PWM_IDR2_CMPM2_Pos)                /* (PWM_IDR2) Comparison 2 Match Interrupt Disable Mask */
#define PWM_IDR2_CMPM2(value)                 (PWM_IDR2_CMPM2_Msk & (_UINT32_(value) << PWM_IDR2_CMPM2_Pos)) /* Assigment of value for CMPM2 in the PWM_IDR2 register */
#define PWM_IDR2_CMPM3_Pos                    _UINT32_(11)                                         /* (PWM_IDR2) Comparison 3 Match Interrupt Disable Position */
#define PWM_IDR2_CMPM3_Msk                    (_UINT32_(0x1) << PWM_IDR2_CMPM3_Pos)                /* (PWM_IDR2) Comparison 3 Match Interrupt Disable Mask */
#define PWM_IDR2_CMPM3(value)                 (PWM_IDR2_CMPM3_Msk & (_UINT32_(value) << PWM_IDR2_CMPM3_Pos)) /* Assigment of value for CMPM3 in the PWM_IDR2 register */
#define PWM_IDR2_CMPM4_Pos                    _UINT32_(12)                                         /* (PWM_IDR2) Comparison 4 Match Interrupt Disable Position */
#define PWM_IDR2_CMPM4_Msk                    (_UINT32_(0x1) << PWM_IDR2_CMPM4_Pos)                /* (PWM_IDR2) Comparison 4 Match Interrupt Disable Mask */
#define PWM_IDR2_CMPM4(value)                 (PWM_IDR2_CMPM4_Msk & (_UINT32_(value) << PWM_IDR2_CMPM4_Pos)) /* Assigment of value for CMPM4 in the PWM_IDR2 register */
#define PWM_IDR2_CMPM5_Pos                    _UINT32_(13)                                         /* (PWM_IDR2) Comparison 5 Match Interrupt Disable Position */
#define PWM_IDR2_CMPM5_Msk                    (_UINT32_(0x1) << PWM_IDR2_CMPM5_Pos)                /* (PWM_IDR2) Comparison 5 Match Interrupt Disable Mask */
#define PWM_IDR2_CMPM5(value)                 (PWM_IDR2_CMPM5_Msk & (_UINT32_(value) << PWM_IDR2_CMPM5_Pos)) /* Assigment of value for CMPM5 in the PWM_IDR2 register */
#define PWM_IDR2_CMPM6_Pos                    _UINT32_(14)                                         /* (PWM_IDR2) Comparison 6 Match Interrupt Disable Position */
#define PWM_IDR2_CMPM6_Msk                    (_UINT32_(0x1) << PWM_IDR2_CMPM6_Pos)                /* (PWM_IDR2) Comparison 6 Match Interrupt Disable Mask */
#define PWM_IDR2_CMPM6(value)                 (PWM_IDR2_CMPM6_Msk & (_UINT32_(value) << PWM_IDR2_CMPM6_Pos)) /* Assigment of value for CMPM6 in the PWM_IDR2 register */
#define PWM_IDR2_CMPM7_Pos                    _UINT32_(15)                                         /* (PWM_IDR2) Comparison 7 Match Interrupt Disable Position */
#define PWM_IDR2_CMPM7_Msk                    (_UINT32_(0x1) << PWM_IDR2_CMPM7_Pos)                /* (PWM_IDR2) Comparison 7 Match Interrupt Disable Mask */
#define PWM_IDR2_CMPM7(value)                 (PWM_IDR2_CMPM7_Msk & (_UINT32_(value) << PWM_IDR2_CMPM7_Pos)) /* Assigment of value for CMPM7 in the PWM_IDR2 register */
#define PWM_IDR2_CMPU0_Pos                    _UINT32_(16)                                         /* (PWM_IDR2) Comparison 0 Update Interrupt Disable Position */
#define PWM_IDR2_CMPU0_Msk                    (_UINT32_(0x1) << PWM_IDR2_CMPU0_Pos)                /* (PWM_IDR2) Comparison 0 Update Interrupt Disable Mask */
#define PWM_IDR2_CMPU0(value)                 (PWM_IDR2_CMPU0_Msk & (_UINT32_(value) << PWM_IDR2_CMPU0_Pos)) /* Assigment of value for CMPU0 in the PWM_IDR2 register */
#define PWM_IDR2_CMPU1_Pos                    _UINT32_(17)                                         /* (PWM_IDR2) Comparison 1 Update Interrupt Disable Position */
#define PWM_IDR2_CMPU1_Msk                    (_UINT32_(0x1) << PWM_IDR2_CMPU1_Pos)                /* (PWM_IDR2) Comparison 1 Update Interrupt Disable Mask */
#define PWM_IDR2_CMPU1(value)                 (PWM_IDR2_CMPU1_Msk & (_UINT32_(value) << PWM_IDR2_CMPU1_Pos)) /* Assigment of value for CMPU1 in the PWM_IDR2 register */
#define PWM_IDR2_CMPU2_Pos                    _UINT32_(18)                                         /* (PWM_IDR2) Comparison 2 Update Interrupt Disable Position */
#define PWM_IDR2_CMPU2_Msk                    (_UINT32_(0x1) << PWM_IDR2_CMPU2_Pos)                /* (PWM_IDR2) Comparison 2 Update Interrupt Disable Mask */
#define PWM_IDR2_CMPU2(value)                 (PWM_IDR2_CMPU2_Msk & (_UINT32_(value) << PWM_IDR2_CMPU2_Pos)) /* Assigment of value for CMPU2 in the PWM_IDR2 register */
#define PWM_IDR2_CMPU3_Pos                    _UINT32_(19)                                         /* (PWM_IDR2) Comparison 3 Update Interrupt Disable Position */
#define PWM_IDR2_CMPU3_Msk                    (_UINT32_(0x1) << PWM_IDR2_CMPU3_Pos)                /* (PWM_IDR2) Comparison 3 Update Interrupt Disable Mask */
#define PWM_IDR2_CMPU3(value)                 (PWM_IDR2_CMPU3_Msk & (_UINT32_(value) << PWM_IDR2_CMPU3_Pos)) /* Assigment of value for CMPU3 in the PWM_IDR2 register */
#define PWM_IDR2_CMPU4_Pos                    _UINT32_(20)                                         /* (PWM_IDR2) Comparison 4 Update Interrupt Disable Position */
#define PWM_IDR2_CMPU4_Msk                    (_UINT32_(0x1) << PWM_IDR2_CMPU4_Pos)                /* (PWM_IDR2) Comparison 4 Update Interrupt Disable Mask */
#define PWM_IDR2_CMPU4(value)                 (PWM_IDR2_CMPU4_Msk & (_UINT32_(value) << PWM_IDR2_CMPU4_Pos)) /* Assigment of value for CMPU4 in the PWM_IDR2 register */
#define PWM_IDR2_CMPU5_Pos                    _UINT32_(21)                                         /* (PWM_IDR2) Comparison 5 Update Interrupt Disable Position */
#define PWM_IDR2_CMPU5_Msk                    (_UINT32_(0x1) << PWM_IDR2_CMPU5_Pos)                /* (PWM_IDR2) Comparison 5 Update Interrupt Disable Mask */
#define PWM_IDR2_CMPU5(value)                 (PWM_IDR2_CMPU5_Msk & (_UINT32_(value) << PWM_IDR2_CMPU5_Pos)) /* Assigment of value for CMPU5 in the PWM_IDR2 register */
#define PWM_IDR2_CMPU6_Pos                    _UINT32_(22)                                         /* (PWM_IDR2) Comparison 6 Update Interrupt Disable Position */
#define PWM_IDR2_CMPU6_Msk                    (_UINT32_(0x1) << PWM_IDR2_CMPU6_Pos)                /* (PWM_IDR2) Comparison 6 Update Interrupt Disable Mask */
#define PWM_IDR2_CMPU6(value)                 (PWM_IDR2_CMPU6_Msk & (_UINT32_(value) << PWM_IDR2_CMPU6_Pos)) /* Assigment of value for CMPU6 in the PWM_IDR2 register */
#define PWM_IDR2_CMPU7_Pos                    _UINT32_(23)                                         /* (PWM_IDR2) Comparison 7 Update Interrupt Disable Position */
#define PWM_IDR2_CMPU7_Msk                    (_UINT32_(0x1) << PWM_IDR2_CMPU7_Pos)                /* (PWM_IDR2) Comparison 7 Update Interrupt Disable Mask */
#define PWM_IDR2_CMPU7(value)                 (PWM_IDR2_CMPU7_Msk & (_UINT32_(value) << PWM_IDR2_CMPU7_Pos)) /* Assigment of value for CMPU7 in the PWM_IDR2 register */
#define PWM_IDR2_Msk                          _UINT32_(0x00FFFF0F)                                 /* (PWM_IDR2) Register Mask  */

